{
	"START": {
		"name": "at... where are you exactly?",
		"desc": "This isn't right... you were busy hard at work one minute on some code for a game, and now you're here. \nSomething is not right. \nNeedless to say, you stand in the middle of a bizarre place. \nIt's a vast, open plain of sorts, but there's no grass, trees, or anything remotely Earth-like. \nThe skies above you look very similar to the night sky, stars floating about in the darkness. \nHowever, there were strange, wispy strands floating about around the air, of every color imaginable. \nThe ground was solid and dark, almost like black marble.\nYou could see your reflection on it, and it had that overall shiny sheen to it. \nTaking a step forward, the moment your foot hits the ground, very much like rippling water, a wave of colors goes out in all \ndirections across the ground, the rainbow ripple going beyond what the eye can see. \nYou take a few more steps forward, and watching the colors move across the ground below your feet in awe. \nYou then look up to see a shadowy silhouette standing a fair distance from you. \nThe mysterious figure then turns around, revealing himself to be an ordinary person. \nHe had messy jet black hair, golden tan skin, wore a dark jacket over a red and white t-shirt, dark jeans, and black tennis shoes. \nHe was somewhat tall, and very much slender. Almost like a pole. His face? Concealed by a white and red mask. \nBefore you can even say anything, he smiles. \n    ''It appears we are... connected. Wonderful. Truly wonderful.'' he said. His voice was... distorted a bit. Almost glitching. But he remained calm and collected. \n    ''Take a step into my little world... won't you? Consider it a... brief commercial break from reality.'' he said. \nWhat could be the meaning of this? What was going on? \n    ''Please... take a gander into... pure imagination. The world of my creation... what you'll see will defy explanation.'' The boy said. \nWithout warning, three doors appeared behind the enigmatic male, one was red, one was blue, and the other green. \nHe then looked back at you. \n    ''My world is full of possibilities... choose the path you wish to traverse.'' he said.",
		"exits": [
			{
				"exit": "RED",
			"target": "UNDERGROUND"
		}, {
			"exit": "BLUE",
			"target": "REPUBLIC"
		}, {
			"exit": "GREEN",
			"target": "LEGEND"
			}
		]
	}
	,"UNDERGROUND": {
		"name": "now standing in the Ruins.",
		"desc": "Opening the red door, you walk through and briefly enter darkness, and the door disappears behind you. \nAll of a sudden, everything comes into view, and the world manifests around you once more. \nA warm and loving aura could be felt here. \nSeeing the beauty of the bright, vivid pink brick walls, the autumn red leaves all piled up in a tidy manner... \nYou are filled with... something familiar. Strange monsters walk about and roam peacefully. \nA frog-like creature ribbits at you before hopping away. \nA bright red heart began to materialize in front of you, a bit away from where you stood. \nIt pulsates with pure energy... and you can feel it's power radiating. This fills you with... something interesting. \nVery interesting. \nThe outline of the boy from earlier begins to appear, around the heart. It looked as if the heart was in the middle of his body now. \nThe illusory figure danced briefly, the heart flickering and flashing, in tune with an actual heartbeat... it was almost as if it had a SOUL. \nIn a flash of bright red light, the boy from earlier now stood there, smiling. \nHis outfit had changed. He was now just wearing a simple blue and purple striped shirt, and a plain pair of pants and shoes. \n    ''You must be wondering who I am. My name is N.'' \n    ''You can call me that. You'll know who I am, in no time. For now... just follow me.'' he said. \nFollowing 'N' through the Ruins, you watch in awe and confusion as he dances about. \nGolden flowers sprout up from the ground with each step he took. The aroma of these flowers was very calming... \nN twirled about on his feet, like some sort of ballet dancer, and as he moved about, the atmosphere around you two began to change. \nSwirls and splashes of color appeared on the pretty pink walls. \nIt looked like Bob Ross's paint palette had been thrown all over the place. It was aesthetic, in it's own weird way. \nDoing cartwheels now, across a small bed of neatly raked leaves, all sorts of plants began to sprout up from the ground, from small trees and bushes, to beautiful multi-colored flowers. \nThe monsters from earlier watch as you both pass by, in awe with N's display of magic. \nWhat type of trip were you experiencing right now? It was all so... surreal. \nEventually, you both arrive at another doorway. This door was light grey, devoid of color. \n    ''Our next destination awaits. Close your eyes... hold your breath. Let your imagination run wild.'' N said. \n    ''When you're ready, just... walk in. Don't let your imagination leave your mind.'' he added. ",
		"exits": [
			{
				"exit": "DOORWAY",
				"target": "GOLDENCOUNTRY"
			}
		]
	}
	,"GOLDENCOUNTRY": {
		"name": "in the center of a beautiful traditional-style town, right outside a large, beautifully adorned palace. People were all over the place.",
		"desc": "\nOnce again, the door behind you disappears as soon as you step through. N didn't follow... or so it seemed. \nCherry blossoms float about in the light breeze, and the weather was perfect. The skies were a bright blue, with puffy white clouds. \nManifesting himself underneath one of the trees, N reappeared, this time wearing different clothing, reflecting the style of everyone else. \n    ''There's a reason why I'm taking you to places that seem like they're out of fantasy, fiction.'' N said, as he approached you. \nYou once again were about to say something, but get cut off by him. \n    ''This is the capital of a proud nation, set atop a magnificent titan.'' \n    ''In this world, humans live on these giant titans.'' N said. \n    ''This titan is famously known as the 'Golden Country', for how prosperous and mighty it stands amongst the others.'' N added. \nHe then began to move again, walking towards the exit of the main courtyard outside the palace, and towards the marketplace. \nYou hesitate at first, but then begin to follow N as he leads you on yet another tour, and inevitably a display of bewilderment. \nWalking past the knights guarding the palace courtyard, you enter the commercial district, where many shops & restaurants are. \nFriendly faces smile at you as you walk by, some waving to you and saying hello. \nN walked past people, not as bouncy as he was in the Ruins. Noticing a crying child, he stopped, and approached her. \nHer toy doll had broken into pieces. \nYou stand behind N, and watch as he gets down, and pulls a handkerchief seemingly out of nowhere, and wipes the tears off of her face. \nHe then picks up the doll fragments, and places them in the handkerchief, wrapping them up, before he turns around, looking past you. \nHe then reaches out, and you turn around to see what he was doing. \nAlmost like magic, you could see the gorgeous, colorful fabrics hanging outside of a shop glow brightly. From the fabrics, strands of magic floated towards you and N, each strand a different color. \nYou try to touch the colorful magic, but your hands phase right through it. \nThey fly through the air, disappearing into the palm of N's hand. \nHe then turns around, and gently places his hand on top of the handkerchief, which then begins to glow all sorts of colors. \nBoth you and the child watch carefully, as N then puts his hand down and unwraps the handkerchief. \nThe doll was... fixed. And it looked beautiful, now, no longer tattered and worn. He then held up the doll, handing it back to her. \nThe child was filled with joy, and she took the doll with glee, smiling once again. \nYou didn't know how N did any of this, but then again, none of this was making any sense to you. \nHe then got up, and motioned for you to follow him again, as he began walking through town. \nTwilight was beginning to set upon the town, and the skies were now a golden hue. \nAs you slowly exited the marketplace, and entered the residential district, you noticed a family of four sitting by a few crates and boxes. \nWithout warning, and still walking forward, N waved his hand, and the boxes disappeared, and in the middle of the empty space behind the family, a brand new house began to materialize from the ground up. \nWalls manifested out of nowhere, followed by windows, doors, and lights. \nThe roof then appeared in the air above the house, and slowly lowered itself onto the now finished abode. \nThe family, realizing what happened, was filled with happiness, and quickly entered their new home. \nAfter you had your fill of watching this, you looked forward, realizing N was leading you to what looked like a dock of sorts,\nleading out to what appeared to be an endless horizon, and a sea of clouds below. \n    ''Our next destination arrives. Closer to the end now.'' \n    Just keep your imagination alive... anything you can think of, keep thinking about it.'' N said. \nWithout warning, N dived straight into the Cloud Sea, disappearing. You didn't wanna jump, but you had no other way...",
		"exits": [
			{
				"exit": "CLOUDSEA",
				"target": "MEMORYSPACE"
			}
		]
	}
	,"MEMORYSPACE": {
		"name": "... once again, you don't know where you are now.",
		"desc": "\nFalling for what feels like an eternity, you eventually land on solid ground, once more. The world looked very similar to the one you were at in the beginning. \nN manifests behind you, wearing his normal clothes from earlier. He then moves around you, and smiles. \n    ''The end is fast approaching. But this is what I wanted you to see.'' N said, as he steps in front of you. \nThe skies begin to crack and splinter, before splitting asunder, revealing mystic teal and turquoise skies. \nThere were floating islands, with buildings, homes, biomes like forests and mountains... it was like miniature worlds! \nYou watch as the ground below you falls away- merely a platform, and N grabs onto you. \nYou both begin to plummet down onto one of the islands, which vaguely resembled a peculiar college campus of sorts. \nYou stood by the famous fountain, and looked around. There was the auditorium, the library, the fine arts building, the museum... \nAnd the winding road leading down from the fountain was there too. It felt familiar. \n    ''You know this place, like I do. It's home. It's the campus.'' N said, as he sat down on the edge of the fountain. \n    ''Now... with imagination, I can make anything happen here. Anything I could dream of- which is exactly what you witnessed with the past two places we visited. Let's bring some of that here, shall we?'' he said, as he tapped his foot down onto the stone ground. \nA wave of light shot out in all directions, and portals began to open up across the skies. Beams of magic shot down from these portals, bringing forth new people, places, and things... \nYou then looked back at N, who smiled as the world began to change into a place that seemed like fantasy. \nThe dull gray stone sidewalks then began to pulsate, before turning a vivid red and pearl white. \nThe fountain, which was originally empty and not working, began to turn on, and sparkling, shining clear water began to spout freely once more, filling up the fountain. \nFlowers, trees, bushes, that had all disappeared to the winter weather, began to grow back, and even more colorful and vibrant than ever before. \nOn top of the flora that was already typically seen on the campus, new and exotic plants began to sprout up, all the iconic crimson and white colors. \nThere were gigantic flowers that bloomed, that were primarily red with strange white designs on their petals. \nThe trees that began to grow were enormous, growing way past the height of the already present trees, and surpassing heights of some of the tallest buildings known on campus. \nN then grabbed your hand, and he began to run down the main road, you barely able to keep up with him. \nHe then jumped up into the air, taking you with him, and you both begin to rise up off of the ground and soar through the air. \n. \n. \n. \n. \nLooking down, you can see everything. Not just the campus area. Further down the road ahead, it no longer looked like campus, but an amalgamation of the worlds from before. \nThere were all sorts of buildings and colorful skyscrapers piercing the clouds, and lights, plenty of them. \nThere were flying cars and vehicles soaring about, and some strange yet beautiful animals that were flying about in the skies too. \nSnapping his fingers, N then tightens the grip on your hand, as he then pulls you close to him, before you both begin to fall... \n... And then land right on top of what appeared to be some sort of silver starship. \nEntering in through the top hatch, you then see N take control. \nYou look out the window at the world outside, seeing the impossible right before your eyes. \nBuildings sticking out of buildings, places from fantasy that you've only seen or heard of in books, television and games were now coming to life... \n    ''Can you imagine what the world would look like if we could unleash our minds onto it? We already do, to an extent. But not like this.'' N said. \nYou then move up into the pilot's cabin, and look out the front window, seeing what looked like a gigantic mansion up ahead. \nN lands the ship gracefully outside, and you both exit the ship. Walking up the shining marble staircases, you come up to a large set of doors. \n    ''No, this isn't to another world. Just inside.'' N said, as he pushes them open. \nFor someone with skinny arms like him, pushing these gigantic wooden doors open with ease was a sight to see. \nThen again, nothing he did made sense previously. \nYou were becoming accustomed to the impossible. \n. \n. \n. \nWalking inside, it was like beautifully adorned, like a hotel of sorts. There was all sorts of furniture placed about, fancy tables, and etc. \nA large, snowglobe-like aquarium stood in the center of the main room, with all sorts of colorful jellies gracefully drifting about inside. \nWalking with N down one of the hallways, you could see the hallway was beginning to twist and turn, but you were still fine. \nGravity wasn't an issue here. \nOpening up a beautiful wooden door with a big yellow star on the front, N stepped aside to let you look in. \nInside, you could see it lead into a certain, timeless castle, with colorful blue walls, painted clouds, and green hills. \nThere were all sorts of doors just like the one N opened, and a big staircase leading up from the center to a second level. \nThis was the castle of a playful princess, the same castle where a certain plumber journeyed through painting portals to defeat the evil king and save her. \nClosing the door, N then lead you to another door, this one was more round, and made of a light bluish steel. \nIt had a vault-like handle, and looked like it would belong on a naval vessel. \nTurning the handle and pushing it open, N once again stepped aside to let you peek through. \nYou saw an entire underwater world, with a heavy cartoonish feel, with colorful flower shapes high above like clouds. \nPink jellyfish buzzed past the doorway, and you looked around more. \nOne of the roads branching off from the main town had three strange houses settled on the side- a gigantic rock, an Easter Island head, and a gigantic... pineapple? \nEven from far away, you could hear the faint sounds of obnoxious laughter come from their direction. \nClosing the door once again, you keep viewing more and more rooms that lead into worlds you had only seen in fiction and fantasy. \nA realm where war was waged over a mythical ring... a wizarding world where a prophecy was fulfilled... a city where squid kids fight in battles for turf... \n. \n. \n. \n. \nThere was one last door. At the far end of the hallway, it was a door that looked like it lead into a classroom almost. \nOpening it up, you see rows of tables with computers at them. A podium stood at the end of two rows, with another computer on it. \nWalking past you, N then sits down at one of the computers, close to the podium. There was a laptop sitting on a black case on the desk he was at. And a backpack right by it. \nHe then motioned for you to come sit by him. \nYou then move to sit at the computer next to him. You noticed you also had some stuff in front of you, including a laptop with Visual Studio Code open. \n    ''Well... it's time for you to leave this place. This place, I know you're still wondering where are we.'' N said, as he started to put away the laptop. \n    ''For the past... I don't know how many minutes... you've been walking in my world of imagination.'' he said. \nWhat could that even mean? Was this all not real? It all certainly felt real. \n    ''No, none of this was real. It's all in my head... You did ask me after all, where do I get my creativity. And what goes on inside my crazy mind sometimes.'' \n    ''So, I decided to let you in. See now? Everything you've seen, funnels into my imagination. People's imagination keeps my imagination flowing.'' he said. \n    ''You were trying to think of new ideas for a game... well, the reason why I did all this was to try and convey something- can you guess what it is?'' N asked. \nYou then think hard for a moment. \n    ''... Dream big. Think crazy. The only thing that's stopping you is yourself. Tap into the impossible, and you'll find endless ideas awaiting you.'' he said. \n    ''Anything you want to, do it. Want to make a world? There's nothing to it.'' N said, as he then pointed at the laptop in front of you. \nYou look at the laptop, and then notice a shining light that has just appeared, floating over the keyboard. \n    ''I've went this long without breaking the fourth wall... go ahead. Just type the word 'LIGHT' in.'' N said, as he continued putting his stuff away.",
		"exits": [
			{
				"exit": "LIGHT",
				"target": "END"
			}
		]
	}
	,"REPUBLIC": {
		"name": "in the center of a vivid, red office, likely belonging to someone of great authority.",
		"desc": "There were several, strange bronze statues in the corners of the room, and a large, sleek desk of sorts, with an equally large chair, fit for an emperor or supreme chancellor. \nStanding behind the chair, and looking out the massive, long window that easily took up the entire back wall, was the same boy you had seen earlier, before you went through the portal. \nHe was now wearing what looked like a beige tunic of sorts, with a brown belt, and a large, brown cloak of sorts over it. \nThis was the timeless, iconic look of a powerful peacekeeper. But why was he dressed like this? \n    ''So, you've chosen the blue portal. Interesting indeed.'' the boy said, turning around, his arms crossed. \nYou stare at him, confused by the situation. Where were you? And why are you here? \nLooking out behind him, you had the most beautiful view of a massive, bustling city, with ships flying through the skies like cars in rush hour traffic. \nBuildings pierced the skies, and there were plenty of them, some big, some small. \n    ''You must be wondering why you're here. And who I am. Well, I can answer one of those questions right away.'' he said, smiling. \n    ''You may call me N- that's all I'm gonna give you. Who I really am is something you may not know, just yet.'' he said, as he motions for you to come close and see out the window. \nWalking around the desk, you stand by the window, looking out to see the beauty of this gigantic, futuristic-like city. \nThe sun was setting upon the world, and the view was just... breathtaking. \n    ''My dear friend, I ask that you treat me to a... tour. If you would like to see more wonderous sights, you need only follow me.'' N said, as he began to make his way towards the exit of the office. \nYou could briefly catch a glimpse of what looked like a shiny, silver sword hilt, clipped to his belt. You knew what that was- it was an elegant weapon, for a more civilised age. \nNeedless to say, you followed N out of the office, heading right for the doorway...  ",
		"exits": [
			{
				"exit": "DOORWAY",
				"target": "AETHER"
			}
		]
	}
	,"AETHER": {
		"name": "now entering what appears to be an entirely new dimension, with colorful floating islands all over the place, and you stand right on the largest one. You take note that the entire world, and the landscape... was blocky. Very pixelated. ",
		"desc": "\nYou were just in the office of some high-authority one minute. And now you were here. \nThe door leading back to the chancellor's office was now gone, once you stepped through. \nGigantic odd-shaped clouds, some in chunks, some in clusters, others in swirls filled the skies, and the skies below. \nSome were white, some blue, and the ones up high were gold. It was... a sight to behold. \n    ''This place holds a special place in my heart... it's from my childhood. Long ago. A game I used to play.'' N said, as he stepped out onto the pastel green grass, walking underneath a large, golden tree. \nHe then began to pet what looked like a fluffy bunny, one that jumped pretty high up, and floated down as if it was light as a feather. \nLooking around, you see a gigantic holy temple sitting atop a bunch of silvery clouds floating in the sky. \n    ''The fabled Valkyries live there... a honoraable bunch, they are. Their queen? Equally as honorable.'' N said, as he elbows the tree, making a golden apple fall into your hand. \nYou look at the strange fruit in your hand, feeling an ethereal power radiating from it. It just felt... holy. \nTaking a bite of it, your taste buds are hit with a sweet, divine flavor, one unlike any you've ever tasted before. It wasn't overly sweet, but it wasn't overly bitter either. \nThe apple itself was incredibly juicy, and fresher than anything. The core of the apple a bright pink in color, like a grapefruit, and you could see the seeds in the core. The seeds were a bright blue, and even glowed a bit, like tiny crystals. \nFinishing the apple and then tossing it aside, you watch as the apple flies off the island and down into the sea of clouds below. \n. \n. \n. \n. \nTo your surprise, the apple floats back up, before exploding into a burst of golden energy. \nWhen you turn back around, after looking away from the bright light, you can now see that an entirely new island had appeared in the air. \nThis island was shaped almost like a sphere of sorts, and had dozens, and dozens of the same golden trees on it. \nYou could see the golden leaves gently falling from the trees, and the gentle winds blow them about around the island's diameter. \nThese leaves shined in the sunlight, and with so many circling around the island, it was like a holy, slow-moving golden cyclone was protecting the island. \nStanding up, N then taps your shoulder, and motions for you to follow him. \nFollowing the enigmatic sorcerer, you pass by hills and valleys, and see strange versions of animals from the world you're so used to. \nSilver cows with grey spots, and huge, bright golden wings, pigs with golden wings, sheep with the largest, fluffiest coats of wool, with strange designs and colors, floating about... \nThe occasional bunny would hop by, and one of them would hop onto N's head and settle themselves down on him, and N wasn't bothered by it. \nA gelatinous cube of light blue slime, with dark eyes hopped towards you slowly, curious, before it hops away, leaping up into one of the trees. \nLoud, echoing moans and whines could be heard from afar, and when you look out past the island, you can see gigantic, bluish-silver whales with yellow markings flying in pods across the sky. \nYou both then make your way towards another island, higher up than the one you were on, and you could see what looked like a massive tunnel in the lower side of the island. \nN, without stopping, waves his hand, and several of the trees in the area fall down, the leaves falling off and flying into the wind. \nThe trunks of these trees then glow, before transforming into dozens of planks, which then fly out over the chasm between the islands. \nEach plank then sets itself out, forming together to become an entire bridge. The last of the tree logs then morph into fencing, and line up along the bridge. \nThere was now a fully finished bridge awaiting you both, leading right up into the cavern of sorts. \nWalking over the bridge with N, you look out at the other islands, and just everything else in general before following N into the darkness. \n. \n. \n. \n. \nRaising his hands a bit, two yellow flames appear in N's palms, and light up the cavern. Ahead, you could see what looked like the inside of a temple, or dungeon. \nThe walls and floor were made of carved, dark grey stone, each block with a 2x2 grid pattern. On some of the stones, small blue runes could be seen carved into some of the tile squares. \nThese runes glowed in the dark, giving a mystical feel. \nOut from the darkness, came a... living chest? It had legs, and ferocious teeth, and it's eye was inside of it's mouth. \nIt roars in anger, charging at you both. You step back out of shock, but watch in even more surprise as a strange, purple gemstone sword falls out of N's jacket sleeve. \nN then performs two quick strikes in succession, and you watch as the mimic freezes, before falling over, crumbling to pieces. \nN then puts the sword away, and walks deeper into the dungeon, and you follow behind him for protection. \nEntering a large chamber, you notice a gigantic grey block with what looked like a big singular eye carved in the middle of it. \nIt had a gigantic eye carved on each of it's sides, save the top and bottom. \n    ''Might want to stand back.'' N said, as he pulled out what looked like a pink pickaxe of sorts. \nYou do as he says, and watch as N pulls his arm back, and throws the pickaxe at the giant cube. The eyes of the gigantic chunk open up, revealing it's blue eyes. \nThe monstrous stone guardian then rises up into the air, looking down at you and N. \nN smirks, as he grabs his pickaxe once more, and leaps into the air, using both hands to deliver a powerful downward swing with his strange tool onto the monster. \nCrumbling into pieces and exploding, the cyclops-like guardian was no more, and a portal made out of bright, yellow stone appeared against the wall. \nThe portal frame was glowing extremely brightly, lighting up the whole room, and the portal itself was a watery blue. \n    ''The end is coming up. Come on.'' N said, as he hops through the portal, tossing the pickaxe aside.",
		"exits": [
			{
				"exit": "PORTAL",
				"target": "MEMORYSPACE"
			}
		]
	}
	,"LEGEND": {
		"name": "now standing in the middle of an open, grassy field, and the breath of the wild gently blows on your skin; the wind very light but noticeable.",
		"desc": "There were some ruins nearby, several, in fact, and they looked almost ancient- like they were 100 years old or something. \nThis felt... somewhat normal. There was a forest nearby, and when you turned around, you could see a giant cliff face... in reality, it was a great big plateau. \nYou then begin to walk around, exploring the landscape, until you see a yet another person in the distance. This person was wearing a blue tunic, with several brown belts, brown pants, and some leather boots. Whoever they were, they were armed with a strange sword, a blue shield with a famous ensignia on it, and a sturdy-looking bow. \nThe back of their head was concealed- they were wearing a black cloak of sorts, with patterns weaved onto the back of the fabric. \nTurning around, and taking the hood off, you could see it was the boy from earlier. He then approaches you, smiling. \n    ''It's me again. You might be wondering what happened. Where you are. Well, I can help with that.'' he said, as he turned his head, in the direction of something. \nLooking where he was looking, you could see a gigantic castle in the distance, and some sort of ominous purple energy swirling around it. Seeing the castle filled you with a strange sense of... dread. \nAs if some sort of great evil was residing at the castle, biding its' time for the right moment to strike... \n    ''We're not going to the castle, by the way. Nope. Someone else in this world is destined to, not us.'' the boy said, as he turned to face you again. \n. \n. \n. \n. \n    ''You can call me N, by the way. What's my real name, you ask? Well, I'll let you find out soon enough.'' N said. \nStrange fellow. And what did he mean by 'this world'?? Does that mean they were in some sort of new universe or something? \nN then began to walk through the forest, motioning for you to follow him. \nYou hesitantly follow the strangely dressed male, mostly because you didn't want to be left alone here. Who knows what could live here? \n    ''You may know this world, actually. I don't know for sure.'' he said, as he cut through some thick bushes and grass. \n    ''This land is known for it's royal princess and legendary hero, who fight the king of evil time and time again.'' he said. \nThis was definitely... familiar now. \nStopping, N puts his arm out to stop you as well, and he motions for you to get down. \nYou get on your knees, as he does, and N moves slowly behind one of the bushes nearby, looking through it. You follow behind him, staying crouched down. \nN was looking through the bush at a small monster camp. There were these red, pig-like humanoid monsters, with weapons and clubs, sitting around a campfire. \n    ''Stay here. Don't move. Gotta take these guys out.'' N said, as he pulls out his bow, and then leaps up into the trees, almost like a blur. \n You move to where he originally was, and look through the bush like he did, waiting to see what would happen. \nNothing happened, for a few minutes. \nWhere did he go? Did he abandon you? How were you gonna get out of here now?! \nWithout any warning at all, whatsoever, one of the monsters fell face-forward into the fire, with about twelve arrows sticking out of the back of it's head and back. \nOuch. That had to hurt. \nThe other monsters panicked, and grabbed their clubs and spears, looking around to take down whoever dare slay their comrade. \nAn apple could be seen rolling around the ground, in the direction of the monsters, who notice and watch it curiously. \nOne of the pig monsters stepped forward, looking at the apple, about to grab it... when all of a sudden... \n. \n. \n. \n. \n... an arrow, charged with the power of electricity, flew right into the stomach of the monster, causing it to writhe and shake about as it was shocked! \nN then leapt out of the blue, landing in front of the monster, and delivering three swift punches, to the face, the chest, and the mouth, before delivering two devastating kicks to the shins and... well. A spot that really hurts. \nThe monster squealed in pain, and fell over, decimated by the onslaught. \nThe monsters pointed at N, and charged at him with their weapons. \nN then drew his sword and shield, before running right at the monsters with his shield out in front of him. He began yelling loudly, and boy, was it intimidating. \nThe monsters yelp and whimper, startled by the running charge, and try to turn around, but it was too late. \nN rams his shield into one of the monsters, knocking them over, then uses his sword to cut the spear in half, leaving the one monster with just... a stick. \nThe monster squeals in fear, seeing it's weapon destroyed, then looks at N to see him ready to strike. \nAnd that's exactly what happened. N swipes at the monster twice, quickly slaying the monster effortlessly. He then turns around, seeing one of the monsters carrying a club charging at him from behind. \nLike a certain star-spangled superhero, he hurls his shield out like a frisbee right at the monster, hitting it right in the mouth and immediately KO'ing it. \nN stood, unfazed by the failed counterattack. One of the monsters began to get up, the one he charged into earlier, but N picks up the apple he rolled out earlier and throws it like a baseball at the monster's head, knocking him out cold. \n    ''Alright, you're safe. Come on out. You never told me your name, by the way. Eh. It's fine.'' N said, shrugging. He wasn't breaking a sweat even. \nOnwards, you both went, and you eventually arrive at a field full of tall grass, up to your knees, and you could see all sorts of colorful flowers. \nOne type in particular was a light sky blue and white, and it caught your eye. \n    ''The Silent Princess. So rare to see it growing naturally in the wild.'' N said, as he walked over to the exotic flower. \nPulling out a strange looking tablet of sorts with a large eye on the back of it, he uses it to... take a picture? \nGetting up, N looks over at you... no, he was actually looking behind you. \n    ''I do believe I see our destination... a shrine, just up ahead.'' he said, pointing to the large, strange monument behind you, not far away. \nIt was shaped funny, and at the top, there was an orange, glowing eye symbol. A console of sorts sat underneath the symbol, right by what looked like a lift or elevator down. \nApproaching this shrine with N, you examine some of it's features- like the ruins, the monument looked incredibly old, yet incredibly advanced at the same time. \nPlacing his strange tablet-thing on the top of the console, you watch as the orange lights turn blue, not just on the console, but on the giant eye, too. \nThe lights on the floor underneath the shrine's spire lit up, and you could see that it was indeed a lift of sorts. \nWalking underneathe and onto the platform, N motioned for you to stand with him. \n    ''Come on. So much to see, yet so little time.'' he said. ",
		"exits": [
			{
				"exit": "SHRINE",
				"target": "GLEAMING"
			}
		]
	}
	,"GLEAMING": {
		"name": "... or you were, orginally on the lift with N. After it began to take you both down, a few minutes later, you were now falling, through what seems to be infinite darkness, until you finally hit solid ground... You look up.",
		"desc": "A seraphic menace with wings of all sorts of colors floated high up in the skies above... a ball of light being the core of this monster. \nThe world below him was unlike any other- you saw the worlds of video games you loved and knew had been mashed together and scrambled into this... dimension of light. \nArmies of famous fighters could be seen, doppels of the originals, and faded in color. The millions of red eyes you could see across the landscape glowed brightly. \n    ''We've arrived in a... smashing situation, haven't we?'' N said, looking over the cliffs. \nStepping to the side, an adorable pink puffball of sorts wearing red shoes and having the cutest face walked past, looking over the landscape. \nA fading sunrise was rising in the dark... glimmering shadows lie in wait for the time to strike. \nThe pink hero then began making his way down the cliffs, towards the plateau below- a brawl was brewing, ready to begin. \nN then grabs onto you again, and the world around you begins to change. \nYou were now standing with him, in the middle of a gigantic platform that was big enough to have dozens of people on it. \nSmaller platforms floated up above, in jumping reach. \nBehind you, you could see an army had assembled: of the video game world's most iconic heroes and villains. All standing in unity. \nAnd in opposition, high above, the otherworldly god of light floated up ahead, with many, many disembodied hands behind it, floating eerily in the skies. \n    ''Our final destination awaits, but it's not here. We must move forward. Light will guide us out of here...'' N said, as a new portal of light appeared in front of you both. \nThe fighters had begun their assault, and the forces of undying light had begun their counterattack. \nCreating a barrier around the portal and you both, N begins to walk towards the portal. \n    ''When you're ready, walk through. I'll see you on the other side.'' N said, as he disappears into the light.",
		"exits": [
			{
				"exit": "PORTAL",
				"target": "MEMORYSPACE"
			}
		]
	}
	,"END": {
		"name": "now beginning to slowly wake up, slowly realizing that everything that just happened... was a figment of your imagination. N was right.",
		"desc": "You see that you were in the exact same chair, in the exact same spot as before. Your laptop was open in front of you, in Visual Studio. Just like before. \n    ''... and that's all the time we have for today, tomorrow we will be working more with Godot, anyone who needs help can stay after and I'll see what I can do.'' someone said. \nIt was Professor Francis. \nYou looked to the person next to you, and surely enough, it was N. You look at him dumbfoundedly. \nHe was putting more of his stuff away, and zipping his backpack up. He then looks to face you. \n    ''What's up? You look like you've just been on a little adventure. Or seen something... out-of-this-world.'' He said, smirking. \nHe then winks briefly before putting his backpack on, and zipping up his inner jacket, before heading out of the classroom. \nYou watched as he left, then look at your computer. You begin to remember what happened before you ended up in his world. \nYou were busy coding your text adventure game, and you were talking to him, when he said to ''use your imagination''. \nBecause you didn't know what to write about for your game. \nWhen you stopped talking with him, you had began to stare at your screen, and that's when you zoned out. \nBut was it really his world? After all, it was your mind that dragged you in there. \nMaybe it was your imagination that was showing you everything, and not N's at all. \n    ''Did Nick already leave?'' someone asked. \nYou then look in the direction of that person. Now knowing his name, you told them ''yes''. \n    ''Oh, shoot. I was gonna ask him for help on the text adventure project.'' he said. \nYou then smile. \n. \n. \n. \n. \n         ''... Just use your imagination.'' you said.",
		"exits": [
			{
				"exit": "UNKNOWN",
				"target": "Your choices don't matter anymore. Nice try though."
			}
		]
	}
}


